src/ExchangePlans/МобильноеПриложение/МобильноеПриложение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExchangePlan thisNode="02d384bc-5675-41bb-9ba8-9f5634dca527">
  <name>МобильноеПриложение</name>
  <attributes>
    <name>Активность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияОбмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияФорматаОбмена</name>
    <comment>Версия формата обмена в формате ХХ.ХХ.ХХ.ХХ</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидВыгружаемогоПериода</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьОперацииТолькоПоУказаннымКошелькам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПринятого</name>
    <comment>Дата принятого пакета</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗатребованныйСценарий</name>
    <comment>Сценарий, по которому удаленный узел должен подготовить и вернуть данные</comment>
    <type>
      <types>EnumRef.СценарииОбменаСМобильнымПриложением</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВыгружаемыхПериодов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МобильноеУстройство</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательБазы</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательМобильногоУстройства</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрироватьИзменения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СинхронизацияЗапрещена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Кошельки</name>
    <attributes>
      <name>Кошелек</name>
      <type>
        <types>CatalogRef.КошелькиИСчета</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ExchangePlan>

src/InformationRegisters/СтатистикаСправочников/СтатистикаСправочников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатистикаСправочников</name>
  <comment>Вспомогательная информация для использования в отборах</comment>
  <resources>
    <name>КоличествоНеактуальных</name>
    <comment>(Инф.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоАктуальных</name>
    <comment>(Инф.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоПомеченных</name>
    <comment>(Инф.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоВалют</name>
    <comment>(Инф.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоСвободных</name>
    <comment>(Инф.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоДляНакоплений</name>
    <comment>(Инф.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоКредиток</name>
    <comment>(Инф.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоБезналичных</name>
    <comment>(Инф.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоНаличных</name>
    <comment>(Инф.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоВзатыхДолгов</name>
    <comment>(Инф.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоВыданныхДолгов</name>
    <comment>(Инф.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <dimensions>
    <name>Ссылка</name>
    <type>
      <types>CatalogRef.Контакты</types>
      <types>CatalogRef.СтатьиРасходов</types>
      <types>CatalogRef.КошелькиИСчета</types>
      <types>CatalogRef.СтатьиДоходов</types>
      <types>CatalogRef.Имущество</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/ExchangePlans/МобильноеПриложение/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	СинхронизацияАвтономныхКопий.УзелОбменаПередЗаписью(ЭтотОбъект, Отказ);
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовый() И Не ЗначениеЗаполнено(ВерсияФорматаОбмена) Тогда
		ВерсияОбмена            = СинхронизацияАвтономныхКопийКлиентСервер.МинимальнаяВерсияФормата();
		ВерсияФорматаОбмена     = ВерсияОбмена;
	КонецЕсли;
	
	Если Не Ссылка.Пустая() Тогда
		
		Если ПометкаУдаления И Активность И НЕ Ссылка.Активность Тогда
			ПометкаУдаления = Ложь;
		ИначеЕсли ПометкаУдаления И НЕ Ссылка.ПометкаУдаления И Активность Тогда
			Активность = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения = Неопределено Тогда
		Активность              = Истина;
		ВерсияОбмена            = СинхронизацияАвтономныхКопийКлиентСервер.МинимальнаяВерсияФормата();
		ВерсияФорматаОбмена     = ВерсияОбмена;
		МобильноеУстройство     = Истина;
		РегистрироватьИзменения = Истина;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ЗаписьНовогоУзла", ЭтоНовый());
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	СинхронизацияАвтономныхКопий.УзелОбменаПриЗаписи(ЭтотОбъект, Отказ);
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ОбменДаннымиСервер.НастройкаСинхронизацииЗавершена(Ссылка) Тогда
		ОбменДаннымиСервер.ЗавершитьНастройкуСинхронизацииДанных(Ссылка);
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ПолучениеСообщенияОбмена") Тогда
		БюджетированиеСервер.ОбновитьВсеКлючиСтатейБюджета();
		РегистрыСведений.СтатистикаСправочников.ОбновитьВсюСтатистикуСправочников();
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

#КонецЕсли
